АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеруПропарки/алк_ЗагрузкаВКамеруПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаВКамеруПропарки</name>
  <registerRecords>AccumulationRegister.алк_УчетВремениПропарки</registerRecords>
  <registerRecords>InformationRegister.алк_СтатусПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиВКамерахПропарки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.алк_СменыШпон</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапускаКамеры</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативПропарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдётЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияПропарки</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативноеВремяПропарки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ОперацииПропарки/алк_ОперацииПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперацииПропарки</name>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
  <enumValues>
    <name>Выгрузка</name>
  </enumValues>
  <enumValues>
    <name>Пропарка</name>
  </enumValues>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>Готова</name>
  </enumValues>
  <enumValues>
    <name>Обслуживание</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеруПропарки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных

	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗагрузкаВКамеруПропарки, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();     
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗагрузкаВКамеруПропарки);
		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиВКамерахПропарки", МассивРезультатовЗапроса[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСтатусыПропарки", МассивРезультатовЗапроса[1].Выгрузить());
		
	КонецПроцедуры
    	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	алк_ЗагрузкаВКамеруПропаркиНоменклатура.Ссылка.НачалоЗагрузки КАК Период,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	алк_ЗагрузкаВКамеруПропаркиНоменклатура.Ссылка.Организация,
		|	алк_ЗагрузкаВКамеруПропаркиНоменклатура.Ссылка.СтруктурнаяЕдиница,
		|	алк_ЗагрузкаВКамеруПропаркиНоменклатура.Ссылка.КамераПропарки КАК Ячейка,
		|	алк_ЗагрузкаВКамеруПропаркиНоменклатура.Объем
		|ИЗ
		|	Документ.алк_ЗагрузкаВКамеруПропарки.Номенклатура КАК алк_ЗагрузкаВКамеруПропаркиНоменклатура
		|ГДЕ
		|	алк_ЗагрузкаВКамеруПропаркиНоменклатура.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗагрузкаВКамеруПропарки.НачалоЗагрузки КАК Период,
		|	алк_ЗагрузкаВКамеруПропарки.Ссылка КАК Регистратор,
		|	алк_ЗагрузкаВКамеруПропарки.КамераПропарки,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПропарки.Загрузка) КАК Статус,
		|	алк_ЗагрузкаВКамеруПропарки.НачалоЗагрузки КАК ВремяНачала,
		|	алк_ЗагрузкаВКамеруПропарки.ОкончаниеЗагрузки КАК ВремяОкончанияПлан
		|ИЗ
		|	Документ.алк_ЗагрузкаВКамеруПропарки КАК алк_ЗагрузкаВКамеруПропарки
		|ГДЕ
		|	алк_ЗагрузкаВКамеруПропарки.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ЗагрузкаВКамеруПропарки.ОкончаниеЗагрузки,
		|	алк_ЗагрузкаВКамеруПропарки.Ссылка,
		|	алк_ЗагрузкаВКамеруПропарки.КамераПропарки,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПропарки.Простой),
		|	алк_ЗагрузкаВКамеруПропарки.ОкончаниеЗагрузки,
		|	алк_ЗагрузкаВКамеруПропарки.ВремяЗапускаКамеры
		|ИЗ
		|	Документ.алк_ЗагрузкаВКамеруПропарки КАК алк_ЗагрузкаВКамеруПропарки
		|ГДЕ
		|	алк_ЗагрузкаВКамеруПропарки.Ссылка = &Ссылка
		|	И НЕ алк_ЗагрузкаВКамеруПропарки.ИдётЗагрузка
		|			И алк_ЗагрузкаВКамеруПропарки.ОкончаниеЗагрузки < алк_ЗагрузкаВКамеруПропарки.ВремяЗапускаКамеры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ЗагрузкаВКамеруПропарки.ВремяЗапускаКамеры,
		|	алк_ЗагрузкаВКамеруПропарки.Ссылка,
		|	алк_ЗагрузкаВКамеруПропарки.КамераПропарки,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПропарки.Пропарка),
		|	алк_ЗагрузкаВКамеруПропарки.ВремяЗапускаКамеры,
		|	ДОБАВИТЬКДАТЕ(алк_ЗагрузкаВКамеруПропарки.ВремяЗапускаКамеры, ЧАС, алк_ЗагрузкаВКамеруПропарки.НормативПропарки)
		|ИЗ
		|	Документ.алк_ЗагрузкаВКамеруПропарки КАК алк_ЗагрузкаВКамеруПропарки
		|ГДЕ
		|	алк_ЗагрузкаВКамеруПропарки.Ссылка = &Ссылка
		|	И НЕ алк_ЗагрузкаВКамеруПропарки.ИдётЗагрузка
		|	И алк_ЗагрузкаВКамеруПропарки.ОкончаниеЗагрузки <= алк_ЗагрузкаВКамеруПропарки.ВремяЗапускаКамеры";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
    	
	#КонецОбласти
	
	
	
	#Область СервисныеПроцедурыИФункции
	
	#КонецОбласти
	
	
	
#КонецЕсли
